EWSEditor/RawEwsExamples/CreateItem (Task).xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
  <soap:Body>
    <CreateItem xmlns="http://schemas.microsoft.com/exchange/services/2006/messages"
                MessageDisposition="SendAndSaveCopy">
      <Items>
        <t:Task>
          <t:Subject>
            <!--FIELD:Subject;string-->
          </t:Subject>
          <t:DueDate>
            <!--FIELD:DueDate;date-->
          </t:DueDate>
          <t:Status>
            <!--FIELD:Status;list;NotStarted,InProgress,Completed,WaitingOnOthers,Deferred-->
          </t:Status>
        </t:Task>
      </Items>
    </CreateItem>
  </soap:Body>
</soap:Envelope>
